"""
    Аугментация данных.
    Модуль содержит различные классы и их методы для аугментации данных (генерации данных).
    Класс образованный с применением методов OpenCV
    Класс образованный с применением методов TF.keras.preprocessing.image (ImageDataGenerator)
    Классы как минимум должны включать в себя такие методы как:
          - Изменение контрастности
          - Угол поворота изображения
          - Приближение и отдаление случайных участков
          - Случайное смещение
          - Срез случайной части фото
    Несколько различных классов с целью оценки производительности и изучения различных доступных методов аугментации.
"""

